eBankarstvo/app/controllers/incidents_controller.rb

  def index
     begin
        if params[:status]
          @incidents = Incident.where("status = ?", params[:status]).order('created_at DESC')
        else
          @incidents = Incident.order('created_at DESC')
---
SELECT "incidents".* FROM "incidents" WHERE (status = 'Active') ORDER BY created_at DESC
SELECT "incidents".* FROM "incidents" ORDER BY created_at DESC

  def create
    @category = Category.find_by_id(params[:category])
    @user = User.find(session[:user_id])

    @incident = Incident.new(incident_params)
    @incident.category = @category
    @incident.status = "Active"
    @incident.user = @user

    respond_to do |format|
      if @incident.save
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 2 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]
INSERT INTO "incidents" ("category_id", "created_at", "description", "name", "status", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
      @category = Category.find_by_id(params[:category])
      @priority = Priority.find_by(name: params[:priority])
      @incident.category = @category
      @incident.priority = @priority
      @incident.name = params[:incident][:name]
      @incident.description = params[:incident][:description]
      respond_to do |format|
        if @incident.save
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 3 LIMIT 1
SELECT "priorities".* FROM "priorities" WHERE "priorities"."name" = '-1' LIMIT 1
UPDATE "incidents" SET "priority_id" = $1, "name" = $2, "description" = $3, "updated_at" = $4 WHERE "incidents"."id" = 12  [["priority_id", 1], ["name", "novi incident - pravi naziv"], ["description", "opis - pravi"], ["updated_at", Thu, 02 Apr 2015 17:50:09 UTC +00:00]]

  def solve
    #Waiting to confirm closing
    @incident = Incident.find(params[:id])
    @incident.status = "Active"
    @incident.confirmed = "Waiting"
    if params[:known_incident] != "-1"
      @known_incident = Incident.find_by_id(params[:known_incident])
      @incident.solution = @known_incident.solution
    else
      @incident.solution = params[:incident][:solution]
    end
    @incident.save
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = $1 LIMIT 1  [["id", "8"]]
UPDATE "incidents" SET "confirmed" = $1, "solution" = $2, "updated_at" = $3 WHERE "incidents"."id" = 8  [["confirmed", "Waiting"], ["solution", "Ovaj roblem rjesavamo tako sto.."], ["updated_at", Thu, 02 Apr 2015 12:51:17 UTC +00:00]]

  def solve_form
    @incident = Incident.find(params[:id])
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = $1 LIMIT 1  [["id", "8"]]

  def confirm
    @incident = Incident.find(params[:id])
    @incident.confirmed = "Yes"
    @incident.status = "Closed"
    @incident.save
    user = User.find(session[:user_id])
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = $1 LIMIT 1  [["id", "8"]]
UPDATE "incidents" SET "confirmed" = $1, "status" = $2, "updated_at" = $3 WHERE "incidents"."id" = 8  [["confirmed", "Yes"], ["status", "Closed"], ["updated_at", Thu, 02 Apr 2015 12:51:56 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]

  def decline
    @incident = Incident.find(params[:id])
    @incident.confirmed = "No"
    @incident.status = "Active"
    @incident.save
    user = User.find(session[:user_id])
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = $1 LIMIT 1  [["id", "7"]]
UPDATE "incidents" SET "confirmed" = $1, "updated_at" = $2 WHERE "incidents"."id" = 7  [["confirmed", "No"], ["updated_at", Thu, 02 Apr 2015 12:53:35 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]

    def set_incident
      @incident = Incident.find(params[:id])
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = $1 LIMIT 1  [["id", "8"]]