eBankarstvo/app/controllers/users_controller.rb

SELECT "roles".* FROM "roles" ORDER BY "roles"."id" DESC LIMIT 1
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "role_id", "surname", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @user.role = Role.last
    respond_to do |format|
      if @user.save