eBankarstvo/app/views/changes/_form.html.erb

      <%= label :category_id, "Category" %><br>
      <%= select_tag(:category, options_for_select(Category.dropdown_options, :selected => Category.selected(@category))) %>
---
SELECT "categories".* FROM "categories"

          <%= label :priority, "Priority" %><br>
          <%= select_tag(:priority, options_for_select(Priority.dropdown_options, :selected => Priority.selected(@priority))) %>
---
SELECT "priorities".* FROM "priorities"