app/controllers/changes_controller.rb

SELECT "changes".* FROM "changes" WHERE (status = 'Active') ORDER BY created_at DESC
SELECT "changes".* FROM "changes" ORDER BY created_at DESC
---
  def index
    begin
      if params[:status]
        @changes = Change.where("status = ?", params[:status]).order('created_at DESC')
      else
        @changes = Change.order('created_at DESC')

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]
INSERT INTO "changes" ("created_at", "description", "name", "status", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Mon, 20 Apr 2015 14:36:58 UTC +00:00], ["description", "hgj"], ["name", "xdgbdg"], ["status", "Active"], ["updated_at", Mon, 20 Apr 2015 14:36:58 UTC +00:00], ["user_id", 6]]
---
  def create
    @change = Change.new(change_params)
    @user = User.find(session[:user_id])
    @change.status = "Active"
    @change.user = @user
    respond_to do |format|
      if @change.save

SELECT "categories".* FROM "categories" WHERE "categories"."id" = 2 LIMIT 1
SELECT "priorities".* FROM "priorities" WHERE "priorities"."name" = '1' LIMIT 1
UPDATE "changes" SET "category_id" = $1, "priority_id" = $2, "updated_at" = $3 WHERE "changes"."id" = 2  [["category_id", 2], ["priority_id", 1], ["updated_at", Mon, 20 Apr 2015 15:03:09 UTC +00:00]]
---
  def update

    @category = Category.find_by_id(params[:category])
    @priority = Priority.find_by(name: params[:priority])
    @change.category = @category
    @change.priority = @priority
    @change.name = params[:change][:name]
    @change.description = params[:change][:description]

    respond_to do |format|
      if @change.update(change_params)

SELECT "changes".* FROM "changes" WHERE "changes"."id" = $1 LIMIT 1  [["id", "1"]]
---
    def set_change
      @change = Change.find(params[:id])